---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.IPipePlumbingFixtureFlowServer.Calculate(Autodesk.Revit.DB.Plumbing.PipePlumbingFixtureFlowData)
source: html/0e1515cc-6955-131d-5334-1d087d8d26dd.htm
---
# Autodesk.Revit.DB.Plumbing.IPipePlumbingFixtureFlowServer.Calculate Method

Calculate the pipe plumbing fixture flow.

## Syntax (C#)
```csharp
void Calculate(
	PipePlumbingFixtureFlowData data
)
```

## Parameters
- **data** (`Autodesk.Revit.DB.Plumbing.PipePlumbingFixtureFlowData`) - The input and output data of the calculation.